Autodesk.Revit.DB.MEPSystemType.CalculationLevel
Identifies the calculation level for the system type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.MEPSystemType.MaterialId
Indicates the material id that should override the material for all components in the system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.MEPSystemType.FillVisible
Indicates the visibility of the fill pattern for all components in the system.
Since:
2012

Autodesk.Revit.DB.MEPSystemType.FillPatternId
Indicates the fill pattern id that should override the fill pattern id for all components in the system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.MEPSystemType.FillColor
Indicates the color that should override the fill color for all components in the system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.MEPSystemType.LinePatternId
Indicates the line pattern id that should override the line pattern id for all components in the system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.MEPSystemType.LineColor
Indicates the color that should override the line color for all components in the system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.MEPSystemType.LineWeight
Indicates the weight that should override the line weight for all components in the system.
Since:
2012

Autodesk.Revit.DB.MEPSystemType.SystemClassification
Identifies the classification for the system type
Remarks:
The system classification drives certain behavior such as sizing
and connections to other systems
Since:
2012

Autodesk.Revit.DB.MEPSystemType.Abbreviation
Identifies the abbreviation, the short name, for the system type
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.MEPSystemType
A system type in the Autodesk Revit MEP product.
Remarks:
This is the base class for mechanical and piping system types,
available only in the Autodesk Revit MEP product.
Since:
2012